---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsType.LandingType
source: html/65d623c8-e4af-4b8b-092e-62602d11ecc2.htm
---
# Autodesk.Revit.DB.Architecture.StairsType.LandingType Property

The type for all landings in the stair element.

## Syntax (C#)
```csharp
public ElementId LandingType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The specified landingTypeId is not a valid landing type.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null